// pages/demo01/demo01.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    game:{
      name1:"《命令与征服：红色警戒2》(《Command & Conquer: Red Alert2》)",
      info1:"讲述了爱因斯坦杀死希特勒后，苏联与盟军开战的故事。",
      honour1:"《红警2》成功延续了《命令与征服》这一成功游戏，它为所有技能水平的即时战略类游戏玩家提供了许多的挑战和变化。它特别有趣，非常精美的画面使它既是优秀的续集，又是一个伟大的即时战略游戏。但是它剧情中对二战的夸张设置有些无味。GameSpot给予8.5分的评分（满分10分）。网盘密码：g4t7",
      name2:"太阳帝国的原罪",
      info2:"游戏绕独立的“商人世界”、流放的The Advent和古老的Vasari帝国的残余份子三个种族间的战役冲突展开，被流放的The Advent是“商人世界”的同胞手足，为了卷土重来，他们联合了Vasari帝国的残余份子，对“商人世界”展开了一系列的攻击。",
      honour2:"这款游戏的视觉效果十分出色。把战舰拉近之后玩家会发现，它们的样子帅呆了，而战斗的时候，更是眼花缭乱。把镜头拉远之后，战舰和战斗机会缩小成一些图标，这样方便玩家在全局上掌握战况。游戏界面的设计，也十分出色，各种信息和功能简单明了。音效不算很突出，背景音乐倒是不错。",
      name3:"我的美丽天使",
      info3:"少女在假想空间中与主人公一起生活，即使什么也不做，少女也会自动成长。 玩家能以主人公的身份与少女对话以及进行各种活动以及指令。 随着游戏的进展，少女能帮助主人公一起进行炼金术以及一起采集矿石。",
      honour3:"玩家游戏后可能产生各种沉迷后遗症,如不断通关游戏,审美观大幅度提高,YY自己能遇到像游戏女主角的MM,想要女儿等等。",
    },
    
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})