// pages/demo01/demo01.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    game:{
      name1:"《崩坏3》(《Honkai Impact 3rd》)",
      info1:"游戏讲述了世界受到神秘灾害“崩坏”侵蚀的故事，玩家可扮演炽翎、白夜执事、第六夜想曲、月下初拥、极地战刃、空之律者、原罪猎人等女武神，去抵抗崩坏的入侵，维护好这个世界的和平。游戏拥有圣痕系统、女武神等战斗培养元素，还引入乱斗竞速、舰团战等PVP玩法。",
      honour1:"获得第二届IMGA中国最高大奖。",
      name2:"火影忍者",
      info2:"《火影忍者》手游采用了动漫的情节作为游戏的背景，力争让大家在游戏中，体验到原汁原味的动漫剧情。在一个忍者的世界，故事从主人公漩涡鸣人的孤儿生活开始，四代火影为了保护村子，将攻击村子九尾妖狐封印到了他体内，鸣人因此受尽了村人的冷落，只是拼命用各种恶作剧，试图吸引大家的注意力。在伊鲁卡老师的关心引导下，漩涡鸣人的性格变得非常乐观。",
      honour2:"游戏在主线方面，以剧情副本闯关为主，一个卷轴代表着一个故事，根据动漫的剧情主线，一直到最新的疾风传，完全为玩家们还原出了《火影》的经典剧情桥段，大部分不曾看过《火影》的玩家，认为这些剧情设定比较好的。",
      name3:"奇迹暖暖",
      info3:"《奇迹暖暖》是苏州叠纸网络科技有限公司制作、腾讯游戏独家代理的一款换装养成手机游戏，于2015年5月20日正式上线。",
      honour3:"在整体风格上依然延续着前作的梦幻清新风格，在独特的异世界里，不管是风景还是服装，都变得比前作更加细腻独特、生动迷人、精致还原。该作加入全新的竞技场模式玩法，作为搭配师需要与其他搭配师一起比拼搭配能力，还能依靠换装游戏中独特的技能系统向评委施放技能进行分数干扰，大大增加了游戏的趣味性，满足了玩家心理。",
    },
    
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})