// pages/demo01/demo01.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    game:{
      name1:"巫师3：狂猎（The Witcher 3: Wild Hunt）",
      info1:"经典RPG，不容错过的游戏剧情。",
      honour1:"庞大的外表下还包含着制作组处处留心的细节。《巫师3：狂猎》为杰洛特的故事画上了一个完满的句号。虽然情节不是很有意思，但是剧情中的角色们都有血有肉。游戏的战斗非常爽快，角色扮演的体验也非常棒。这些都把《巫师3：狂猎》提升到了一个其他许多RPG无法企及的高度。",
      name2:"龙之谷2",
      info2:"游戏讲述了邪恶的黑龙入侵阿尔特里亚大陆的故事，玩家可以扮演战士、魔法师、弓箭手、牧师等职业，去捍卫阿尔特里亚大陆。",
      honour2:"作为一款由“龙之谷”IP改编的MMORPG，《龙之谷2》延续了原作的世界观、战斗方式、职业技能效果，与多人巢穴副本玩法等等，同时开创性的加入了自由度极高的探索玩法与社交内容，借助开放的游戏大世界，开拓“龙之谷”IP的玩法边界。",
      name3:"最终幻想",
      info3:"游戏讲述了玩家扮演的光之战士，为了拯救世界展开冒险的故事。",
      honour3:"该作是在任天堂8位机上所发布的《最终幻想》系列鼻祖，游戏的世界架构简单，摒弃了当时红极一时的《勇者斗恶龙》系列所采用的第一人称视角战斗画面，而是创新的推出了自主开发的第三人称回合制战斗画面，第一次让玩家看见了主角的样子和招式。而诸如“飞空艇”、“职业转职”等设定也为以后《最终幻想》系列甚至很多RPG游戏指定了一个发展的方向。虽然画面粗糙、世界观和任务情节比较单调，但是这样一个里程碑式的游戏，众多却点已经不能掩盖其自身所发出的光芒。"
      },
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})