// pages/demo01/demo01.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    game:{
      name1:"《绝地求生》(PUBG)",
      info1:"在该游戏中，玩家需要在游戏地图上收集各种资源，并在不断缩小的安全区域内对抗其他玩家，让自己生存到最后。",
      honour1:"游戏《绝地求生》除获得G-STAR最高奖项总统奖以及其他五项大奖，还打破了7项吉尼斯纪录。",
      name2:"使命召唤",
      info2:"《使命召唤：联合进攻》保留了原来的游戏结构，玩家将会扮演美国、英国和苏联三国的士兵，完成10项以上的任务。开始时，玩家将会在美军阵营中参加巴斯通战役，防御德军的反攻（有著名的2ss装甲师），接着，玩家成为英国皇家空军，在B-17轰炸机编队中轰炸荷兰并执行敌后特种破坏，最后玩家将加入到苏联军队，参加二战最大的坦克大战－－库尔斯克战役。游戏中的人物样貌与原作也是大同小异。",
      honour2:"作为整个系列的开山作品，使命召唤采用了强化过的重返德军总部引擎，在当时可以说是跨时代的画面进步，达到了惊人的效果。在游戏中，引擎完美的表现出大批士兵玩家搭船渡河、领取弹药进攻红场的画面。破损的城市、人物动作等视觉效果上更是可圈可点，当玩家遭到炮轰或者炸弹引爆时，玩家的角色甚至瞬间失去意识，视线模糊。各种良好的表现与出色的射击手感，颠覆了玩家对传统第一人称二战游戏的传统观念。",
      name3:"荣誉勋章",
      info3:"游戏背景设定在现代的战争。这也是《荣誉勋章》系列上市十年来头一次抛弃了二战题材，投入了现代战争的怀抱。",
      honour3:"游戏的个人战役就像是闪电一样，快到令人恶心。在游戏的过程中，似乎总能带给人一种不舒服的感觉，或许是游戏对剧情节奏的把握并没有保持到一致的关系，那些片刻平静之后的激烈战场，往往会让玩家们感到措手不及。",
    },
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})