/* const news = [
  {
    id:'356412',
    title:'电商大战一触即发：荣誉与荣耀对决',
    poster:'https://inews.gtimg.com/newsapp_bt/0/12645135577/1000',
    add_date:'2019-10-21',
    content:'全球总决赛的赛程已经来到了四强赛的阶段，届时四支世界上至强的队伍将两两对决，决出通往总决赛的两个名额。\n四强赛第二日的赛程LPL赛区的第二场内战，三比一战胜JDG的SN将对阵创造让二追三历史的一号种子TES，两支队伍无疑都是LPL赛区的骄傲，而且两队状态也都非常火热，这一场对碰无疑会是一场非常精彩的博弈，TES的硬实力和选手配置非常完美，而SN的进步也是所有召唤师有目共睹的，本期我将为各位召唤师从队伍到选手一一分析两队的强弱优劣，以供参考。\n队伍对比：TESvsSN\n这两队的实力对比可参考的东西有很多，首先自然是作为一号种子的TES在赛区内的表现要优于SN，季后赛TES直接三比零带走SN也可以证明这一点。而两队在世界赛都是作为小组第一出线的，SN的状态攀升却是比TES更加火热，小组赛仅仅一场败绩，对阵JDG也只是输了一场便强势取胜，可见的这支新军的强大，而TES相较而言，在八强赛的表现却不尽如人意，虽然创造了让二追三历史听起来非常提气，但是我个人认为，直接三比零或者三比一才是TES作为LPL一号种子应该有的实力，而这次SN和TES再次对决，就要看TES能不能恢复巅峰时的状态，也要看SN能不能在一号种子的压力之下，能不能保持自己的状态，成功复仇TES。'
  },
  {
    id:'546734',
    title:'G2vsDWG 不同风格再次碰撞',
    poster:'https://inews.gtimg.com/newsapp_bt/0/12645122557/1000',
    add_date:'2019-10-21',
    content:'全球总决赛的赛程已经来到了四强赛的阶段，届时四支世界上至强的队伍将两两对决，决出通往总决赛的两个名额。\n四强赛第一日的赛程是连续三年淘汰 LCK赛区强队的G2对阵LCK最后的希望DWG，G2今年状态火热，一路从自己赛区杀来，而DWG则是展现出了远超LCK赛区的实力， 在自己赛区一路碾压。欧式的快乐打架与韩式的稳健运营，究竟谁更胜一筹？\n四强赛第二日的赛程 LPL赛区的第二场内战，三比一战胜JDG的SN将对阵创造让二追三历史的一号种子TES，两支队伍无疑都是LPL赛区的骄傲，而且两队状态也都非常火热，这一场对碰无疑会是一场非常精彩的博弈，TES的 硬实力和选手配置都非常完美，而SN的进步也是所有召唤师有目共睹的，本期将为各位召唤师从队伍到选手一一分析四强两场战斗，队伍的强弱优劣，以供参考。\nG2vsDWG：队伍对比\n今年世界赛，G2除了被SN双杀以外，仅仅输给过TL一场，不过那一场可以说是G2状态不理想或者上头，参考意义不大。DWG则是仅仅输给过JDG一场小场，其余皆是胜绩，而两队八强淘汰赛上的战绩皆是三比零直接带走对手，取胜的势头也皆是碾压，由此可见，这两支队伍在世界赛上的状态都是非常不错的。\n再看两队在自己赛区的战绩，两者皆是在自己赛区拥有统治级的实力，但是DWG的统治更为彻底，在夏季赛几乎不败的战绩使其在LCK赛区一骑绝尘。然而由于今年的特殊情况，季中赛LCK赛区并未和LEC赛区交锋，因此也不好说双方的实力有如何可比性，因此初步估计为五五之数。\n再看两队风格，DWG则是最为传统的LCK式运营，而也正是这种平稳的运营，击垮了很多LCK的强队，也直接三比零带走了DRX，而G2的风格较为欢乐，会涌现出很多令人意想不到的打法，但是这即是优点，也是缺点，由FNC被让二追三就可以看出赛区打法的弊端，然而正所谓乱拳打死老师傅，G2这种打法恰恰会使得稳健运营的LCK赛区措手不及，这也是LEC赛区战队经常战胜LCK赛区战队的原因，因此这一点G2略占优势。但看战队风格，G2的胜率约为六成。'
  },
  {
    id:'239875',
    title:'闪焰的驻足：可莉获取概率提升！',
    poster:'https://p1-tt.byteimg.com/origin/pgc-image/97d23d0ccfd4401f87109e9e6511909f?from=pc',
    add_date:'2020-10-20',
    content:'亲爱的旅行者：\n活动祈愿「闪焰的驻足」限时开启，旅行者可以在这里获得更多角色与武器，组建强大的队伍!\n(祈愿解锁后，PC端按下F3键、手机端点击右上角十字星图标、PS4端长按L1键开启快捷轮盘选择十字星图标即可打开祈愿界面。)\n〓祈愿时间〓\n2020/10/20 18:00:00~2020/11/09 17:59:59\n〓祈愿介绍〓\n活动期间内，限定五星角色「逃跑的太阳·可莉(火)」的祈愿获取概率将大幅提升!\n活动期间内，四星角色「少年春衫薄·行秋(水)」「未授勋之花·诺艾尔(岩)」「无害甜度·砂糖(风)」的祈愿获取概率将大幅提升!'

  }
] */

//获取新闻列表
function getNewList()
{
  let list = [];
  for( var i = 0; i < news.length; i++){
    let obj = {};
    obj.id = news[i].id;
    obj.poster = news[i].poster;
    obj.content = news[i].content;
    obj.add_date = news[i].add_date;
    obj.title = news[i].title;
    list.push(obj);
  }
  return list;
}

//获取新闻内容
function getNewsDetail(newsID)
{
  let message = {
    code:'404',
    news:{}
  };
  for( var i = 0; i < news.length; i++){
    if( newsID == news[i].id ){
      news[i].content=news[i].content.replace(/\\n/g, "\n"),
      message.code = '200',
      message.news = news[i];
      break;
    }
  }
  return message;
}

module.exports = {
  getNewList:getNewList,
  getNewsDetail:getNewsDetail
}